export const deliveryZones = [
  {
    id: 1,
    name: "Зона доставки",
    // Координаты полигона [широта, долгота]
    geometry: [
      [
        [44.78, 37.77],
        [44.79, 37.80],
        [44.77, 37.82],
        [44.76, 37.78],
      ],
    ],
    // Стили для полигона на карте
    options: {
      fillColor: '#56db40', // Цвет заливки
      fillOpacity: 0.4,     // Прозрачность заливки
      strokeColor: '#278c13', // Цвет обводки
      strokeWidth: 2,       // Ширина обводки
    },
  },
  {
    id: 2,
    name: "Зона платной доставки (200 руб)",
    geometry: [
      [
        [44.80, 37.75],
        [44.81, 37.78],
        [44.79, 37.84],
        [44.78, 37.80],
      ],
    ],
    options: {
      fillColor: '#f2d22e',
      fillOpacity: 0.4,
      strokeColor: '#b0950f',
      strokeWidth: 2,
    },
  },
  // Можно добавить другие зоны
];